from test.test_base import TestBase


class TestSpecialNumbers(TestBase):
    def test_special_value_basic(self):
        _test = self._assert_execute
        _test('ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ', '-inf')
        _test('(ㅂ ㅅ ㄴ ㅂㅎㄹ) ㄴ ㅄㅎㄷ', 'nan+i')
        _test('(ㅂ ㅅ ㅁ ㅂㅎㄹ) ㄴ ㅄㅎㄷ', 'inf+i')
        _test('(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㄴ ㅄㅎㄷ', '-inf+i')
        _test('ㄱ (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ', 'nani')
        _test('ㄴ (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ', '1+nani')
        _test('(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ', 'nan+nani')
        _test('(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ', 'inf+nani')
        _test('(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ', '-inf+nani')
        _test('ㄱ (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ', 'infi')
        _test('ㄴ (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ', '1+infi')
        _test('(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ', 'nan+infi')
        _test('(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ', 'inf+infi')
        _test('(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ', '-inf+infi')
        _test('ㄱ (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ', '-infi')
        _test('ㄴ (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ', '1-infi')
        _test('(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ', 'nan-infi')
        _test('(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ', 'inf-infi')
        _test('(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ', '-inf-infi')

    def test_special_value_addition(self):
        _test = self._assert_execute
        _test('[(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'infi')
        _test('[(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', 'infi')
        _test('[(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'infi')
        _test('[(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'infi')
        _test('[(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄱ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '-infi')
        _test('[(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄱ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', '-infi')
        _test('[(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '-infi')
        _test('[(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nani')
        _test('[(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', '-infi')
        _test('[(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nani')
        _test('[(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', 'nani')
        _test('[(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nani')
        _test('[(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nani')
        _test('[(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', 'nani')
        _test('[(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nani')
        _test('[(ㄴ) (ㄱ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '1+infi')
        _test('[(ㄴ) (ㄱ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', '1-infi')
        _test('[(ㄴ) (ㄱ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '1+nani')
        _test('[(ㄴ) (ㄴ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '1+infi')
        _test('[(ㄴ) (ㄴ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', '1-infi')
        _test('[(ㄴ) (ㄴ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '1+nani')
        _test('[(ㄴ) (ㄴㄱ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '1+infi')
        _test('[(ㄴ) (ㄴㄱ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', '1-infi')
        _test('[(ㄴ) (ㄴㄱ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '1+nani')
        _test('[(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '1+infi')
        _test('[(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', '1+infi')
        _test('[(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '1+infi')
        _test('[(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '1+infi')
        _test('[(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', '1+nani')
        _test('[(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '1+nani')
        _test('[(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '2+infi')
        _test('[(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', '2+infi')
        _test('[(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '2+infi')
        _test('[(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '2+infi')
        _test('[(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄱ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '1-infi')
        _test('[(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄱ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', '1-infi')
        _test('[(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '1-infi')
        _test('[(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '1+nani')
        _test('[(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', '1-infi')
        _test('[(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '1+nani')
        _test('[(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '2-infi')
        _test('[(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', '2-infi')
        _test('[(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '2-infi')
        _test('[(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '2+nani')
        _test('[(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', '2-infi')
        _test('[(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '1+nani')
        _test('[(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', '1+nani')
        _test('[(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '1+nani')
        _test('[(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '1+nani')
        _test('[(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', '1+nani')
        _test('[(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '1+nani')
        _test('[(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '2+nani')
        _test('[(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', '2+nani')
        _test('[(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '2+nani')
        _test('[(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '2+nani')
        _test('[(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', '2+nani')
        _test('[(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '2+nani')
        _test('[(ㄴㄱ) (ㄱ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '-1+infi')
        _test('[(ㄴㄱ) (ㄱ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', '-1-infi')
        _test('[(ㄴㄱ) (ㄱ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '-1+nani')
        _test('[(ㄴㄱ) (ㄱ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'infi')
        _test('[(ㄴㄱ) (ㄱ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', '-infi')
        _test('[(ㄴㄱ) (ㄱ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nani')
        _test('[(ㄴㄱ) (ㄴ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '-1+infi')
        _test('[(ㄴㄱ) (ㄴ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', '-1-infi')
        _test('[(ㄴㄱ) (ㄴ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '-1+nani')
        _test('[(ㄴㄱ) (ㄴ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'infi')
        _test('[(ㄴㄱ) (ㄴ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', '-infi')
        _test('[(ㄴㄱ) (ㄴ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nani')
        _test('[(ㄴㄱ) (ㄴㄱ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '-1+infi')
        _test('[(ㄴㄱ) (ㄴㄱ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', '-1-infi')
        _test('[(ㄴㄱ) (ㄴㄱ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '-1+nani')
        _test('[(ㄴㄱ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'infi')
        _test('[(ㄴㄱ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', '-infi')
        _test('[(ㄴㄱ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nani')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '-1+infi')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', '-1+infi')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '-1+infi')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '-1+infi')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', '-1+nani')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '-1+nani')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'infi')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', 'infi')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'infi')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'infi')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', 'nani')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nani')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '-2+infi')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', '-2+infi')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '-2+infi')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '-2+infi')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄱ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '-1-infi')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄱ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', '-1-infi')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '-1-infi')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '-1+nani')
        _test(
            '[(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', '-1-infi')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '-1+nani')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '-infi')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', '-infi')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '-infi')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nani')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', '-infi')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nani')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴㄱ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '-2-infi')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', '-2-infi')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '-2-infi')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '-2+nani')
        _test(
            '[(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', '-2-infi')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '-1+nani')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', '-1+nani')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '-1+nani')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '-1+nani')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', '-1+nani')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '-1+nani')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nani')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', 'nani')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nani')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nani')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', 'nani')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nani')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '-2+nani')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', '-2+nani')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '-2+nani')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '-2+nani')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', '-2+nani')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '-2+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄱ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+0i')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄱ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+i')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf-i')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf-infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄴ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+0i')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄴ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+i')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄴ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf-i')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf-infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+0i')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+i')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf-i')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf-infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+0i')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄱ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+i')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄱ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+2i')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+0i')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf-infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄴ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+i')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄴ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+2i')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄴ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+0i')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf-infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄴㄱ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+i')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+2i')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+0i')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf-infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+i')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+2i')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄱ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf-i')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄱ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+0i')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf-2i')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf-infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf-i')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+0i')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf-2i')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf-infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf-i')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+0i')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf-2i')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf-infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf-i')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+0i')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf-2i')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄱ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf-infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄱ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf-infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf-infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf-infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf-infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf-infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf-infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf-infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴㄱ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf-infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf-infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf-infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf-infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf-infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf-infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf-infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf-infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] [(ㄱ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+0i')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] [(ㄱ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+i')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] [(ㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf-i')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf-infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] [(ㄴ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+0i')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] [(ㄴ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+i')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] [(ㄴ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf-i')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf-infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+0i')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+i')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf-i')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf-infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+0i')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+i')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan-i')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan-infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+0i')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] [(ㄱ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+i')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] [(ㄱ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+2i')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] [(ㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+0i')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf-infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] [(ㄴ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+i')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] [(ㄴ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+2i')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] [(ㄴ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+0i')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf-infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] [(ㄴㄱ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+i')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+2i')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+0i')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf-infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+i')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+2i')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+0i')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan-infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+i')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+2i')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] [(ㄱ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf-i')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] [(ㄱ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+0i')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] [(ㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf-2i')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf-infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf-i')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+0i')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf-2i')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf-infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf-i')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+0i')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf-2i')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf-infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan-i')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+0i')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan-2i')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan-infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf-i')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+0i')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf-2i')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄱ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf-infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄱ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf-infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf-infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf-infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf-infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf-infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf-infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf-infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴㄱ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf-infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf-infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf-infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf-infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan-infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan-infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan-infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan-infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf-infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf-infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf-infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf-infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', '-inf+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄱ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+0i')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄱ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+i')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan-i')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+infi')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan-infi')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄴ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+0i')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄴ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+i')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄴ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan-i')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+infi')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan-infi')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+0i')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+i')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan-i')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+infi')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan-infi')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+0i')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+i')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan-i')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+infi')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan-infi')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+0i')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+i')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan-i')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+infi')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan-infi')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+0i')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄱ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+i')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄱ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+2i')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+0i')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+infi')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan-infi')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄴ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+i')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄴ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+2i')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄴ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+0i')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+infi')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan-infi')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄴㄱ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+i')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+2i')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+0i')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+infi')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan-infi')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+i')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+2i')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+0i')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+infi')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan-infi')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+i')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+2i')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+0i')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+infi')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan-infi')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+i')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+2i')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄱ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan-i')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄱ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+0i')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan-2i')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+infi')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan-infi')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan-i')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+0i')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan-2i')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+infi')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan-infi')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan-i')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+0i')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan-2i')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+infi')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan-infi')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan-i')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+0i')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan-2i')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+infi')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan-infi')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan-i')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+0i')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan-2i')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+infi')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan-infi')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan-i')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+0i')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan-2i')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+infi')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+infi')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+infi')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+infi')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+infi')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+infi')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+infi')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+infi')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+infi')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+infi')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+infi')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+infi')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+infi')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+infi')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+infi')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+infi')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+infi')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+infi')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+infi')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+infi')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+infi')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+infi')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+infi')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+infi')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄱ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan-infi')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄱ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan-infi')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan-infi')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan-infi')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan-infi')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan-infi')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan-infi')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan-infi')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴㄱ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan-infi')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan-infi')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan-infi')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan-infi')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan-infi')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan-infi')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan-infi')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan-infi')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan-infi')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan-infi')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan-infi')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan-infi')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan-infi')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan-infi')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan-infi')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan-infi')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄷㅎㄷ', 'nan+nani')

    def test_special_value_multiplication(self):
        _test = self._assert_execute
        _test('[(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf+nani')
        _test('[(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf+nani')
        _test('[(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf+nani')
        _test('[(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄱ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄱ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf+nani')
        _test('[(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf+nani')
        _test('[(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf+nani')
        _test(
            '[(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf+nani')
        _test('[(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㄴ) (ㄱ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+infi')
        _test('[(ㄴ) (ㄱ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan-infi')
        _test('[(ㄴ) (ㄱ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㄴ) (ㄴ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf+infi')
        _test('[(ㄴ) (ㄴ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf-infi')
        _test('[(ㄴ) (ㄴ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㄴ) (ㄴㄱ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf+infi')
        _test('[(ㄴ) (ㄴㄱ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf-infi')
        _test('[(ㄴ) (ㄴㄱ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf+nani')
        _test('[(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf+nani')
        _test('[(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf+nani')
        _test('[(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf+nani')
        _test('[(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+infi')
        _test('[(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf+infi')
        _test('[(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf+infi')
        _test('[(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf+infi')
        _test('[(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄱ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄱ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf+nani')
        _test('[(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf+nani')
        _test('[(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf+nani')
        _test(
            '[(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf+nani')
        _test('[(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan-infi')
        _test('[(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf-infi')
        _test('[(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf-infi')
        _test('[(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf+nani')
        _test(
            '[(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf-infi')
        _test('[(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㄴㄱ) (ㄱ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan-infi')
        _test('[(ㄴㄱ) (ㄱ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+infi')
        _test('[(ㄴㄱ) (ㄱ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㄴㄱ) (ㄱ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan-infi')
        _test('[(ㄴㄱ) (ㄱ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+infi')
        _test('[(ㄴㄱ) (ㄱ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㄴㄱ) (ㄴ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf-infi')
        _test('[(ㄴㄱ) (ㄴ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf+infi')
        _test('[(ㄴㄱ) (ㄴ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㄴㄱ) (ㄴ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf-infi')
        _test('[(ㄴㄱ) (ㄴ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf+infi')
        _test('[(ㄴㄱ) (ㄴ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㄴㄱ) (ㄴㄱ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf-infi')
        _test('[(ㄴㄱ) (ㄴㄱ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf+infi')
        _test('[(ㄴㄱ) (ㄴㄱ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㄴㄱ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf-infi')
        _test('[(ㄴㄱ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf+infi')
        _test('[(ㄴㄱ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf+nani')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf+nani')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf+nani')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf+nani')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+infi')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf+infi')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf+infi')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf+nani')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf+infi')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan-infi')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf-infi')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf-infi')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf-infi')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄱ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄱ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf+nani')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf+nani')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf+nani')
        _test(
            '[(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf+nani')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan-infi')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf-infi')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf-infi')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf-infi')
        _test(
            '[(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf+nani')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴㄱ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+infi')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf+infi')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf+infi')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf+nani')
        _test(
            '[(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf+infi')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄱ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄱ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan-infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan-infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄴ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄴ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄴ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf-infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan-infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf-infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan-infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄱ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄱ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan-infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan-infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄴ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄴ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄴ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf-infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf-infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄴㄱ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf-infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan-infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄱ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄱ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan-infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan-infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf-infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan-infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf-infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf-infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf-infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan-infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan-infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄱ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄱ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan-infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan-infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴㄱ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan-infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan-infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] [(ㄱ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] [(ㄱ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan-infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] [(ㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan-infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] [(ㄴ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] [(ㄴ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf-infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] [(ㄴ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan-infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf-infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan-infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] [(ㄱ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] [(ㄱ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan-infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] [(ㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan-infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] [(ㄴ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] [(ㄴ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf-infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] [(ㄴ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf-infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] [(ㄴㄱ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf-infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan-infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf+infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf-infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] [(ㄱ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] [(ㄱ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan-infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] [(ㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan-infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf-infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan-infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf-infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf-infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf-infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan-infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan-infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan-infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan-infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan-infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄱ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄱ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan-infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan-infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴㄱ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan-infi')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan-infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', '-inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'inf+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+infi')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄱ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄱ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄴ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄴ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄴ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄱ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄱ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄴ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄴ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄴ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄴㄱ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] [(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄱ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄱ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] [(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄱ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄱ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴㄱ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] [(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㄴㄱ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test('[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㄴㄱ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')
        _test(
            '[(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] [(ㅂ ㅅ ㄴ ㅂㅎㄹ) (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅄㅎㄷ] ㄱㅎㄷ', 'nan+nani')


    def test_special_value_exponentiate(self):
        _test = self._assert_execute
        _test('ㄴ (ㅂ ㅅ ㄴ ㅂㅎㄹ) ㅅㅎㄷ', '1.0')
        _test('ㄴ (ㅂ ㅅ ㅁ ㅂㅎㄹ) ㅅㅎㄷ', '1.0')
        _test('ㄴ (ㅂ ㅅ ㅁ ㅂㅎㄹ ㄴㄱ ㄱㅎㄷ) ㅅㅎㄷ', '1.0')
