from test.test_base import TestBase


class TestString(TestBase):
    def test_split(self):
        _test = self._assert_execute
        _test("ㅀㄱ ㄱㅇㄱ ㅂㅀㄴ ㄳㅎㄶ ㄱㅀㄷ", "['a', 'b', 'c']", "abc")
        _test("ㅀㄱ ㄱㅇㄱ ㅂㅀㄴ ㄳㅎㄶ ㄱㅀㄷ", "['가', 'a', '1', ' ']", "가a1 ")
        _test("ㅀㄱ ㅀㄱ ㄱㅇㄴ ㄱㅇㄱ ㅂㅀㄷ ㄳㅎㄶ ㄱㅀㄷㅎ ㄱㅀㄷ", "['a', 'b', 'c']", "a b c\n ")
        _test("ㅀㄱ ㅀㄱ ㄱㅇㄴ ㄱㅇㄱ ㅂㅀㄷ ㄳㅎㄶ ㄱㅀㄷㅎ ㄱㅀㄷ", "['평범한', '한글']", "평범한 한글\n ")
        _test(
            "ㅀㄱ ㅀㄱ ㄱㅇㄴ ㄱㅇㄱ ㅂㅀㄷ ㄳㅎㄶ ㄱㅀㄷㅎ ㄱㅀㄷ",
            "['평', '범', '한', '한', '글']",
            "평범한한글\n\n",
        )
        _test("ㅀㄱ ㅀㄱ ㄱㅇㄴ ㄱㅇㄱ ㅂㅀㄷ ㄳㅎㄶ ㄱㅀㄷㅎ ㄱㅀㄷ", "['']", "\n ")
        _test("ㅀㄱ ㅀㄱ ㄱㅇㄴ ㄱㅇㄱ ㅂㅀㄷ ㄳㅎㄶ ㄱㅀㄷㅎ ㄱㅀㄷ", "[' ']", " \n\n")
        _test("ㅀㄱ ㅀㄱ ㄱㅇㄴ ㄱㅇㄱ ㅂㅀㄷ ㄳㅎㄶ ㄱㅀㄷㅎ ㄱㅀㄷ", "['', '']", " \n ")

    def test_join(self):
        _test = self._assert_execute
        _test("ㅀㄱ ㅀㄱ ㄱㅇㄴ ㅂㅀㄴ ㄱㅇㄱ ㄱㅁㅎㄷ ㄳㅎㄶ ㄱㅀㄷㅎ ㄱㅀㄷ", "'a|b|c'", "abc\n|")
        _test(
            "ㅀㄱ ㅀㄱ ㄱㅇㄴ ㅂㅀㄴ ㄱㅇㄱ ㄱㅁㅎㄷ ㄳㅎㄶ ㄱㅀㄷㅎ ㄱㅀㄷ", "'산과 들과 강과 별'", "산들강별\n과 "
        )
