from test.test_base import TestBase


class TestModule(TestBase):
    def test_load_from_path(self):
        _test = self._assert_execute
        _test('(ㅂ ㅂ ㅂㅎㄷ) ㅁㅂㅈㄱㄷㄴㅁㅂㄷㅂㄹㄱㄹㄹㄱㅁㄷㅂㄹㅁㄹㄴㄱㅁㅈㅂㅁㅅㅅㄹㅁㅁㅁㄹㄷㅈㄷㄱㅂㄹㄱㅈㄴㄷㅈ (ㄴ ㄴㄷㄱ ㄱㅇㄱㅎㄷ)ㅎㄴ (ㄱ ㄴ ㄱㅇㄱㅎㄷ)ㅎㄴ ㅎㅎㄴ ㅂㅎㄴ', "'ㄱㄴㄷㄹㅁㅂㅅㅈ'")
        _test('(ㅂ ㅂ ㅂㅎㄷ) ㅅㅂㅁㅈㄷㄱㄹㅈㄴㅁㄷㄱㄹㅂㄷㅈㄱㅅㅅㄱㄱㅂㄷㅈㄱㅈㄷㄱㄱㅈㄹㄴㅂㅂㅈㅈㄱㄹㄷㅁㄹㅂㄹㄴㄹㄴㅂㅁㅁㅂㄹㅁㄱㅈㄷㅂㅁㅂㄹㅈㄴㄴㅁㅁㅅㅂㄱㄷㅈㄱㅅㄹㅁㅅㄴ (ㄴ ㅁㄹㄱ ㄱㅇㄱㅎㄷ)ㅎㄴ (ㄱ ㄴ ㄱㅇㄱㅎㄷ)ㅎㄴ ㅎㅎㄴ ㅂㅎㄴ (ㅂ ㅂ ㅂㅎㄷ) ㅁㅂㅈㄱㄷㄴㅁㅂㄷㅂㄹㄱㄹㄹㄱㅁㄷㅂㄹㅁㄹㄴㄱㅁㅈㅂㅁㅅㅅㅈㄹㅁㄴㄴㅅㅂㅅㅂㅁㅂㅁㄷㄷㅅㅅㄴㄷㅁㄹㅂㄷㅅㅅㅂㅈㅁㄱㄷㄷㅈㄷㄱㅂㄹㄱㅈㄴㄷㅈ (ㄴ ㄷㄹㄱ ㄱㅇㄱㅎㄷ)ㅎㄴ (ㄱ ㄴ ㄱㅇㄱㅎㄷ)ㅎㄴ ㅎㅎㄴ ㅂㅎㄴ ㄶㄷ', "True")

    def test_load_from_literal(self):
        _test = self._assert_execute
        _test('조각글 표 ㅂㅎㄷ', "'ㄱㄴㄷㄹㅁㅂㅅㅈ'")
        _test('ㄱ 조각글 팔로나눈몫 ㅂㅎㄷ ㅎㄴ', "0")
        _test('ㄷㄴㄱ 조각글 팔로나눈몫 ㅂㅎㄷ ㅎㄴ', "1")
        _test('ㄱ 조각글 팔로나눈나머지 ㅂㅎㄷ ㅎㄴ', "0")
        _test('ㄷㄴㄱ 조각글 팔로나눈나머지 ㅂㅎㄷ ㅎㄴ', "2")
        _test('ㄱ 조각글 평범숫자 ㅂㅎㄷ ㅎㄴ', "'ㄱ'")
        _test('ㄴ 조각글 평범숫자 ㅂㅎㄷ ㅎㄴ', "'ㄴ'")
        _test('ㄴㄱ 조각글 평범숫자 ㅂㅎㄷ ㅎㄴ', "'ㄴㄱ'")
        _test('ㄴㄴ 조각글 평범숫자 ㅂㅎㄷ ㅎㄴ', "'ㄴㄴ'")
        _test('조각글 평범숫자 ㅂㅎㄷ 조각글 평범숫자 ㅂㅎㄷ ㄶㄷ', "True")
